tests/suite-root-url-test/12000-conc-400/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /
Document Length:        547 bytes

Concurrency Level:      400
Time taken for tests:   90.333 seconds
Complete requests:      12000
Failed requests:        0
Keep-Alive requests:    12000
Total transferred:      10596000 bytes
HTML transferred:       6564000 bytes
Requests per second:    132.84 [#/sec] (mean)
Time per request:       3011.103 [ms] (mean)
Time per request:       7.528 [ms] (mean, across all concurrent requests)
Transfer rate:          114.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0      11
Processing:   133 2987 1739.0   2978   17956
Waiting:      133 2987 1739.0   2978   17956
Total:        133 2987 1739.0   2978   17956

Percentage of the requests served within a certain time (ms)
  50%   2978
  66%   3488
  75%   3756
  80%   4004
  90%   4765
  95%   5988
  98%   7493
  99%   8757
 100%  17956 (longest request)